In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv(r"E:\MACHINE_LEARNING\House_2.csv")
df

   Area  Bedroom  Age    Price
0  1500      2.0    8  2500000
1  2000      3.0   11  3000000
2  2500      3.0    7  3300000
3  2100      NaN   13  3100000
4  3000      4.0    1  3800000
5  3100      4.0    9  4000000
6  3900      4.0   22  2200000
7  3400      NaN   10  3500000
8  3330      4.0    6  5600000
9  1800      2.0    5  2600000

In [3]:
#if you had noticed above we have NaN value which means that cell is empty
#Now let's see how to handle NaN values
#Let's insert the median value into the empty cells

med=df['Bedroom'].median()
med

3.5

In [4]:
#As you all know the number of the bedroom cant be 3.5 so we have to conver it into an integer 
import math
bed=math.floor(med)
bed

3

In [5]:
#Now we are filling all the NaN values with the median of that column
df.Bedroom=df.Bedroom.fillna(bed) #USe the fill NaN value permanently
df

   Area  Bedroom  Age    Price
0  1500      2.0    8  2500000
1  2000      3.0   11  3000000
2  2500      3.0    7  3300000
3  2100      3.0   13  3100000
4  3000      4.0    1  3800000
5  3100      4.0    9  4000000
6  3900      4.0   22  2200000
7  3400      3.0   10  3500000
8  3330      4.0    6  5600000
9  1800      2.0    5  2600000

In [6]:
#Now formula : y=m1*x1+m2*x2+m3*x3+c

#m1,m2,m3         = Co-efficient
#Area,Bedroom,Age = Independent Variable(x) [Features]
#c                = Intercept

x=df[['Area','Bedroom','Age']]
y=df['Price']

from sklearn.linear_model import LinearRegression
reg=LinearRegression()
reg.fit(x,y) #.fit is used to train our Linear regression model

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [7]:
reg.coef_                    # values of m1,m2,m3

array([ 1.66769396e+02,  6.57543763e+05, -1.04049744e+05])

In [8]:
reg.intercept_               # values of c

1769010.7017902858

In [10]:
reg.predict([[3450,3,5]])    #Area,Bedroom,Age       output is Price

array([3796747.68660065])

In [11]:
#Same this is done above this is just for your understanding
((1.66769396e+02)*(3450))+((6.57543763e+05)*3)+((-1.04049744e+05)*5)+ 1769010.7017902858

3796747.686990286